{
    "format": "layers-model",
    "generatedBy": "keras v2.5.0",
    "convertedBy": "TensorFlow.js Converter v3.12.0",
    "modelTopology": {
        "keras_version": "2.5.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                32,
                                6
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "conv1d_4_input"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_4",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                32,
                                6
                            ],
                            "dtype": "float32",
                            "filters": 100,
                            "kernel_size": [
                                4
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "bias_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_5",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 100,
                            "kernel_size": [
                                4
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "bias_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "name": "max_pooling1d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "strides": [
                                2
                            ],
                            "pool_size": [
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_6",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 100,
                            "kernel_size": [
                                4
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "bias_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_7",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 100,
                            "kernel_size": [
                                4
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "bias_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.5,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_1",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 700,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "bias_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_4",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 700,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "bias_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 9.999999747378752e-06
                                }
                            },
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_5",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "categorical_accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0005000000237487257,
                    "decay": 1e-05,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin",
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "name": "conv1d_4/kernel",
                    "shape": [
                        4,
                        6,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_4/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_5/kernel",
                    "shape": [
                        4,
                        100,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_5/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_6/kernel",
                    "shape": [
                        4,
                        100,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_6/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_7/kernel",
                    "shape": [
                        4,
                        100,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_7/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/kernel",
                    "shape": [
                        700,
                        700
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/bias",
                    "shape": [
                        700
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_4/kernel",
                    "shape": [
                        700,
                        700
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_4/bias",
                    "shape": [
                        700
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_5/kernel",
                    "shape": [
                        700,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_5/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}